OpenFOAM-6-cantera/tutorials/incompressible/pisoFoam/RAS/cavity/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 22.4;

boundaryField
{
    movingWall
    {
        type            omegaWallFunction;
        value           uniform 22.4;
    }
    fixedWalls
    {
        type            omegaWallFunction;
        value           uniform 22.4;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
